backend/app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" IS NULL LIMIT ?  [["LIMIT", 1]]
---
    def create
        user = User.find_by(username: params[:username])