backend/app/controllers/trips_controller.rb

    def show
        @trip = @user.trip.find_by(id: params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = ?  [["user_id", 8]]